#+TITLE: Generating Quadratic Symmetry Breakers for Bin Packing
#+AUTHOR: Johannes Middeke and Mǎdǎlina Eraşcu
#+DATE: Version 0.2 (May 2026)

** Experiment Specifications


An experiment specification consists of

+ the number of permutations to use (ie, the maximal number of
  different breakers which will be generated),
+ a function which determines which polynomials to include in the
  output,
+ a textual description of the experiment, 
+ the pool of transpositions from which to generate the permutations,
  and
+ a specificiation for the base polynomial.

We provide abbreviations for the two most common exclusion
criteria. These will be used in the [[#template-tables][template tables]]. We also provide
abbreviations for extracting the different kinds of permutations from
a symmetries specificiation. Moreover, we provide a function which
allows to run a specificiation directly.

#+BEGIN_SRC ocaml :tangle breakers.ml :eval never
type experiment = {
    permutations : int;
    exclude : Polynomial.t -> bool;
    descr : string;
    transpositions : symmetries -> Perm.t array;
    base : spec   
  }

let no_linear q = Polynomial.(is_zero q || is_linear q)
and no_zero q = Polynomial.is_zero q

let row_perms {row_perms} = row_perms
and col_perms {col_perms} = col_perms
let all_perms {all_perms} = all_perms


let run ~sexp ~prefix ~repeat ~problem ~symmetries
      {permutations; descr; transpositions; base} =
  let base_gen () = of_spec problem base in
  Experiment.run
    ~sexp ~prefix ~permutations ~descr ~repeat
    ~transpositions:(transpositions symmetries)
    base_gen
#+END_SRC






We will generate the actual code for the experiments from the tables
below using the power of {{{Org}}} and {{{Noweb}}}. The tables have
sixe columns:

+ Vars :: a descriptive label for the number of variables in the
  experiment,
+ Perms :: a descriptive label for the number of permutations in the
  experiment,
+ Class :: a shorthand for the shape of the generated base polynomial,
+ Specifications :: the exact shape of the generated base polynomial,
+ Permutations :: how many permutations to apply (ie, the maximal
  number of inequalities generated from the base polynomial),
+ Transpositions :: which kind of transpositions to use.


We will distinguish between fixed and relative sizes in the table by
using the following abbreviation: For fixed size specifications we
have single integers ~n~ which we do not need to process any further.
However, for relative size specifications we have terms of the form
~u/p/v~ instead where \(u, v\) are integers and \(p\) is a float. We
will need to translate those into a relative size function
call. Moreover, we need to replace all the fixed sized constructors
with their relative size counterparts.

The tables are read by the {{{ELisp}}} code below and automatically
translated into {{{OCaml}}} syntax when the source code is tangled. It
creates two list which contains all the fixed size and relative size
experiments specified in the given tables. (Currently, which tables
are used has to specified by hand by modifying this {{{Org}}} file.)
Note that the ~Vars~, ~Perms~, and ~Class~ columns are combined into a
single description string.



#+NAME: generate-experiments
#+HEADER: :colnames yes
#+HEADER: :var table=experiments-2000 
#+HEADER: :var name="experiments_2000"
#+BEGIN_SRC emacs-lisp :tangle no :exports both :noweb no :results value :wrap example
(let ((fixed-experiments 
       (cl-loop for (vars perms class spec num-perms transps excl) in table
		for descr = (format "descr = \"%s_vars_%s_perms_%s\""
				    vars perms class)
		for base = (format "base = %s" spec)
		for permutations = (format "permutations = %s" num-perms)
		for transpositions = (format "transpositions = %s" transps)
		for exclude = (format "exclude = %s" excl)
		for experiment = (format "{%s; %s; %s; %s; %s}"
					 permutations descr transpositions
					 base exclude)		
		collect experiment)))
  (concat (format "let %s = [" name)
	  (string-join fixed-experiments "; ")
	  "]"))
#+END_SRC





#+NAME: generate-experiments-alternative
#+HEADER: :colnames yes
#+HEADER: :var fixed-table=experiments-2000 
#+HEADER: :var relative-table=experiments-relative 
#+BEGIN_SRC emacs-lisp :tangle no :exports both :noweb no :results value :wrap example
(let ((fixed-experiments 
       (cl-loop for (vars perms class spec num-perms transps excl) in fixed-table
		for descr = (format "descr = \"%s_vars_%s_perms_%s\""
				    vars perms class)
		for base = (format "base = %s" spec)
		for permutations = (format "permutations = %s" num-perms)
		for transpositions = (format "transpositions = %s" transps)
		for exclude = (format "exclude = %s" excl)
		for experiment = (format "{%s; %s; %s; %s; %s}"
					 permutations descr transpositions
					 base exclude)		
		collect experiment))
      (relative-experiments 
       (cl-loop for (vars perms class spec num-perms transps excl) in relative-table
		for descr = (format "descr = \"%s_vars_%s_perms_%s\""
				    vars perms class)
		for rel-sizes = (replace-regexp-in-string
				"\\([0-9]+\\)/\\([.0-9]+\\)/\\([0-9]+\\)"
				"(relative_size \\1 \\2 \\3)"
				spec)
		for rel-spec = (replace-regexp-in-string
				"\\(Lin\\|Sq\\|Quad\\|Sum\\)"
				"Rel\\1"
				rel-sizes)
		for base = (format "base = %s" rel-spec)
		for permutations = (format "permutations = %s" num-perms)
		for transpositions = (format "transpositions = %s" transps)
		for exclude = (format "exclude = %s" excl)
		for experiment = (format "{%s; %s; %s; %s; %s}"
					 permutations descr transpositions
					 base exclude)		
		collect experiment)))
  (concat
   "let fixed_experiments = ["
   (string-join fixed-experiments "; ")
   "]\n"
   "let relative_experiments = ["
   (string-join relative-experiments "; ")
   "]"))
#+END_SRC

#+RESULTS: generate-experiments
#+begin_example
let fixed_experiments = [{permutations = 50; descr = "few_vars_few_perms_only_x"; transpositions = all_perms; base = Sq (X, 3); exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_only_y"; transpositions = col_perms; base = Sq (Y, 3); exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_mixed"; transpositions = all_perms; base = Quad (X, 3, Y, 3); exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_separate"; transpositions = all_perms; base = Sum [Sq (X, 3); Sq (Y, 3)]; exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_linear_x"; transpositions = all_perms; base = Sum [Lin (X, 7); Sq (Y, 3)]; exclude = no_linear}; {permutations = 50; descr = "few_vars_few_perms_linear_y"; transpositions = all_perms; base = Sum [Sq (X, 3); Lin (Y, 7)]; exclude = no_linear}; {permutations = 50; descr = "few_vars_few_perms_pure_linear_only_x"; transpositions = all_perms; base = Lin (X, 10); exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_pure_linear_only_y"; transpositions = col_perms; base = Lin (Y, 10); exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_pure_linear_x_and_y"; transpositions = all_perms; base = Sum [Lin (X, 5); Lin (Y, 5)]; exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_only_x"; transpositions = all_perms; base = Sq (X, 3); exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_only_y"; transpositions = col_perms; base = Sq (Y, 3); exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_mixed"; transpositions = all_perms; base = Quad (X, 3, Y, 3); exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_separate"; transpositions = all_perms; base = Sum [Sq (X, 3); Sq (Y, 3)]; exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_linear_x"; transpositions = all_perms; base = Sum [Lin (X, 7); Sq (Y, 3)]; exclude = no_linear}; {permutations = 500; descr = "few_vars_many_perms_linear_y"; transpositions = all_perms; base = Sum [Sq (X, 3); Lin (Y, 7)]; exclude = no_linear}; {permutations = 500; descr = "few_vars_many_perms_pure_linear_only_x"; transpositions = all_perms; base = Lin (X, 10); exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_pure_linear_only_y"; transpositions = col_perms; base = Lin (Y, 10); exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_pure_linear_x_and_y"; transpositions = all_perms; base = Sum [Lin (X, 5); Lin (Y, 5)]; exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_only_x"; transpositions = all_perms; base = Sq (X, 25); exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_only_y"; transpositions = col_perms; base = Sq (Y, 25); exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_mixed"; transpositions = all_perms; base = Quad (X, 25, Y, 25); exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_separate"; transpositions = all_perms; base = Sum [Sq (X, 20); Sq (Y, 20)]; exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_linear_x"; transpositions = all_perms; base = Sum [Lin (X, 70); Sq (Y, 20)]; exclude = no_linear}; {permutations = 50; descr = "many_vars_few_perms_linear_y"; transpositions = all_perms; base = Sum [Sq (X, 20); Lin (Y, 70)]; exclude = no_linear}; {permutations = 50; descr = "many_vars_few_perms_pure_linear_only_x"; transpositions = all_perms; base = Lin (X, 1000); exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_pure_linear_only_y"; transpositions = col_perms; base = Lin (Y, 1000); exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_pure_linear_x_and_y"; transpositions = all_perms; base = Sum [Lin (X, 750); Lin (Y, 250)]; exclude = no_zero}; {permutations = 50; descr = "numerous_vars_few_perms_only_x"; transpositions = all_perms; base = Sq (X, 64); exclude = no_zero}; {permutations = 50; descr = "numerous_vars_few_perms_only_y"; transpositions = col_perms; base = Sq (Y, 64); exclude = no_zero}; {permutations = 50; descr = "numerous_vars_few_perms_mixed"; transpositions = all_perms; base = Quad (X, 64, Y, 64); exclude = no_zero}; {permutations = 50; descr = "numerous_vars_few_perms_separate"; transpositions = all_perms; base = Sum [Sq (X, 64); Sq (Y, 64)]; exclude = no_zero}; {permutations = 50; descr = "numerous_vars_few_perms_linear_x"; transpositions = all_perms; base = Sum [Lin (X, 2500); Sq (Y, 50)]; exclude = no_linear}; {permutations = 50; descr = "numerous_vars_few_perms_linear_y"; transpositions = all_perms; base = Sum [Sq (X, 50); Lin (Y, 2000)]; exclude = no_linear}; {permutations = 50; descr = "numerous_vars_few_perms_pure_linear_only_x"; transpositions = all_perms; base = Lin (X, 4000); exclude = no_zero}; {permutations = 50; descr = "numerous_vars_few_perms_pure_linear_only_y"; transpositions = col_perms; base = Lin (Y, 1500); exclude = no_zero}; {permutations = 50; descr = "numerous_vars_few_perms_pure_linear_x_and_y"; transpositions = all_perms; base = Sum [Lin (X, 3000); Lin (Y, 1000)]; exclude = no_zero}]
let relative_experiments = [{permutations = 50; descr = "few_vars_few_perms_only_x"; transpositions = all_perms; base = RelSq (X, (relative_size 3 0.0 3)); exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_only_y"; transpositions = col_perms; base = RelSq (Y, (relative_size 3 0.0 3)); exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_mixed"; transpositions = all_perms; base = RelQuad (X, (relative_size 3 0.0 3), Y, (relative_size 3 0.0 3)); exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_separate"; transpositions = all_perms; base = RelSum [RelSq (X, (relative_size 3 0.0 3)); RelSq (Y, (relative_size 3 0.0 3))]; exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_linear_x"; transpositions = all_perms; base = RelSum [RelLin (X, (relative_size 7 0.0 7)); RelSq (Y, (relative_size 3 0.0 3))]; exclude = no_linear}; {permutations = 50; descr = "few_vars_few_perms_linear_y"; transpositions = all_perms; base = RelSum [RelSq (X, (relative_size 3 0.0 3)); RelLin (Y, (relative_size 7 0.0 7))]; exclude = no_linear}; {permutations = 50; descr = "few_vars_few_perms_pure_linear_only_x"; transpositions = all_perms; base = RelLin (X, (relative_size 10 0.0 10)); exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_pure_linear_only_y"; transpositions = col_perms; base = RelLin (Y, (relative_size 10 0.0 10)); exclude = no_zero}; {permutations = 50; descr = "few_vars_few_perms_pure_linear_x_and_y"; transpositions = all_perms; base = RelSum [RelLin (X, (relative_size 5 0.0 5)); RelLin (Y, (relative_size 5 0.0 5))]; exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_only_x"; transpositions = all_perms; base = RelSq (X, (relative_size 3 0.0 3)); exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_only_y"; transpositions = col_perms; base = RelSq (Y, (relative_size 3 0.0 3)); exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_mixed"; transpositions = all_perms; base = RelQuad (X, (relative_size 3 0.0 3), Y, (relative_size 3 0.0 3)); exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_separate"; transpositions = all_perms; base = RelSum [RelSq (X, (relative_size 3 0.0 3)); RelSq (Y, (relative_size 3 0.0 3))]; exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_linear_x"; transpositions = all_perms; base = RelSum [RelLin (X, (relative_size 7 0.0 7)); RelSq (Y, (relative_size 3 0.0 3))]; exclude = no_linear}; {permutations = 500; descr = "few_vars_many_perms_linear_y"; transpositions = all_perms; base = RelSum [RelSq (X, (relative_size 3 0.0 3)); RelLin (Y, (relative_size 7 0.0 7))]; exclude = no_linear}; {permutations = 500; descr = "few_vars_many_perms_pure_linear_only_x"; transpositions = all_perms; base = RelLin (X, (relative_size 10 0.0 10)); exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_pure_linear_only_y"; transpositions = col_perms; base = RelLin (Y, (relative_size 10 0.0 10)); exclude = no_zero}; {permutations = 500; descr = "few_vars_many_perms_pure_linear_x_and_y"; transpositions = all_perms; base = RelSum [RelLin (X, (relative_size 5 0.0 5)); RelLin (Y, (relative_size 5 0.0 5))]; exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_only_x"; transpositions = all_perms; base = RelSq (X, (relative_size 12 0.0 12)); exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_only_y"; transpositions = col_perms; base = RelSq (Y, (relative_size 12 0.0 12)); exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_mixed"; transpositions = all_perms; base = RelQuad (X, (relative_size 12 0.0 12), Y, (relative_size 12 0.0 12)); exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_separate"; transpositions = all_perms; base = RelSum [RelSq (X, (relative_size 10 0.0 10)); RelSq (Y, (relative_size 10 0.0 10))]; exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_linear_x"; transpositions = all_perms; base = RelSum [RelLin (X, (relative_size 100 0.0 100)); RelSq (Y, (relative_size 10 0.0 10))]; exclude = no_linear}; {permutations = 50; descr = "many_vars_few_perms_linear_y"; transpositions = all_perms; base = RelSum [RelSq (X, (relative_size 10 0.0 10)); RelLin (Y, (relative_size 75 0.0 75))]; exclude = no_linear}; {permutations = 50; descr = "many_vars_few_perms_pure_linear_only_x"; transpositions = all_perms; base = RelLin (X, (relative_size 500 0.0 500)); exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_pure_linear_only_y"; transpositions = col_perms; base = RelLin (Y, (relative_size 85 0.0 85)); exclude = no_zero}; {permutations = 50; descr = "many_vars_few_perms_pure_linear_x_and_y"; transpositions = all_perms; base = RelSum [RelLin (X, (relative_size 300 0.0 300)); RelLin (Y, (relative_size 65 0.0 65))]; exclude = no_zero}]
#+end_example




